reservoirFoam/darcyTwoPhase/tutorial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    openWall
    {
        type            patch;
        nFaces          1;
        startFace       99;
    }
    endWall
    {
        type            patch;
        nFaces          1;
        startFace       100;
    }
    fixedWalls
    {
        type            wall;
        nFaces          200;
        startFace       101;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       301;
    }
)

// ************************************************************************* //
