reservoirFoam/darcyTwoPhase/tutorial/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat     raw;

sets
(
    xAxis 
    {
        type    uniform;
        axis    x;
        start   ( 0 0.05 0.05 );
        end     ( 1 0.05 0.05 );
        nPoints 100;
    }
);


fields          ( Sw );


// ************************************************************************* //
